#include <stdio.h>
int main(){
	int n,k,i,j,h,a[1001]={0};		 //不能用a[1001]={1}初始化为"全1"   灯数n抽象化为:'数组'
	scanf("%d%d",&n,&k);

		for(j = 2; j <= k; j ++)		// 人数'k'抽象化为:(2~k)递增的'for()'
			for(h = j; h <= n; h += j){
				switch(a[h]){
				case 1: a[h] = 0;break;		// 平行关系的'选择'用switch()  不能用if()!
				case 0: a[h] = 1;break;		
											//桶排序，标记法。怎么想到的？-> "标记重复出现的"
				}
			}

	for(i = 1; i <= n; i ++)
		if(a[i] == 0)
			printf("%d ", i);
	printf("\n");
	return 0;
}

/*思路 ：	
		抽象化： 灯数 n -> 数组 口口口口口口       怎么抽象化?一个题总得有'存储''变量',联想各个目标'(n，k)'
					 
				 人数 k -> for()  2 ~ K		      它们各自起到了什么作用？它们能用什么样的'方式'(数组,for()变量)表示
			
		   (k)
			
			2:  2  2+2  2+2+2  2+2+2+2			x倍数？ 抽象化-> 'x+x+x'的形式
			3:  3  3+3  3+3+3  3+3+3+3
			4
			.
			.
			.
			k

